raes5_trup_10_final/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.047633;

boundaryField
{
    movingWall
    {
        type            freestream;
        freestreamValue uniform 0.047633;
    }

    frontAndBack
    {
        type            freestream;
        freestreamValue uniform 0.047633;
    }
	
	trup
    {
        type            kqRWallFunction;
        value           $internalField;
    }

   

}

// ************************************************************************* //
